lectures/vscode/vscode.org
#+TITLE: $\mathrm{\LaTeX}$ in VS Code
#+REVEAL_TRANS: zoom
#+REVEAL_THEME: league


# 
#+OPTIONS: toc:nil num:nil


# #+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
# #RREVEAL_TRANS: zoom

* Basics on VS Code
** Overview
   - VS Code is a free source-code editor made by Microsoft.
   - It was released in 2015.
   - According to [[https://insights.stackoverflow.com/survey/2019#development-environments-and-tools][Developer Survey Results 2019]], VS Code is the most popular
     development environment.
** Installation
   - Download here: https://code.visualstudio.com/
** Open files
#+ATTR_REVEAL: :frag (roll-in)
   - You can open a file by drag-and-drop.
   - *CMD + P* allows you to search files.
   - Note: *CMD* means Command Key for Mac and Control Key for Windows.
** Command Pallette
#+ATTR_REVEAL: :frag (roll-in)
   - *CMD + SHIFT + P* opens a command line showing all commands.
   - We will call this command line CP. 
   - Probably the most important keyboard shortcut!
   - Very helpful when you forgot keyboard shortcuts.
   - You can also discover many things using CP.
   - Quiz: How can you make the minimap disappear?
   - Hint: Search "minimap" at CP, and you will get the answer.
** How to change settings
#+ATTR_REVEAL: :frag (roll-in)
   1. CP $\rightarrow$ "Preferences: Open Settings (UI)" (or type *CMD+,*)
   2. Search "Editor: Font Size".
   3. Enter 14 (or any font size you want) in the box.
   4. Exercise: Disable the line number.
** How to change themes
#+ATTR_REVEAL: :frag (roll-in)
   - Search "theme" at CP, and choose "Preferences: Color Theme".
   - You can check out more themes from extensions.
** How to install extensions
#+ATTR_REVEAL: :frag (roll-in)
   1. Click the icon "Extensions" on the left.
   2. Search the extension you want to install.
   3. Click "Install".
*** Community Material Theme (extension)
#+ATTR_REVEAL: :frag (roll-in)
    1. Install "Community Material Theme" extension.
    2. Select "Community Material Theme Palenight (Higher Contrast)" from
       "Preferences: Color Theme" as we did above.
*** Code Spell Checker (extension)
    - Quick fix: *CMD + .*

* LaTeX Workshop (extension)
** Installation
   - First you need to install LaTeX Workshop using "Extensions" icon as before.
** Basic commands
#+ATTR_REVEAL: :frag (roll-in)
   - *TeX Compile* 
      - To build a pdf type *CMD + OPTION + B*. 
      - If you forgot this, search "latex build" at CP.
      - Alternatively, you can simply save the tex file.
      - What's the shortcut for "Save"? (Hint: CP)
   - *View PDF*
      - To view a pdf, type *CMD + OPTION + V*. 
      - If you forgot this, search "latex pdf" at CP.
   - *Inverse Search* (find source code from pdf)
      - *CMD + left click on the pdf* 
   - *SyncTeX from cursor* (Forward Search)
      - *CMD + OPTION + J*
*** Exercises
    1. Find the shortcuts for "Copy" and "Paste".
    2. Discover what "Copy Line Up" and "Copy Line Down" mean.
    3. Find the shortcut for "Find".
    4. Find a way to comment a line.
    5. Experiment with your finding in 4 by using its shortcut after selecting a
       region.
** Move between sections or labels
#+ATTR_REVEAL: :frag (roll-in)
   - Click the icon $\mathrm{\TeX}$ on the left.
   - This will show the sidebar with sections and labels.
   - By clicking a section here you can move to that section in your tex file.
   - You can toggle the sidebar with *CMD + B*. If you forgot this, you know what
     to do.
** Some interesting features
#+ATTR_REVEAL: :frag (roll-in)
   - Auto Completion: Try to type ~\begin{theorem}~
   - Collapsing environments
     - Click the down arrow appearing at the left of an environment.
   - Preview
     - Place your mouse pointer at an equation.
   - Latex Snippet Panel 
     - CP $\rightarrow$ "Latex Workshop: Show Snippet Panel"
   - Typing "\ref{" shows all labels.
     - By clicking the arrow at the right corner, you can see the content of the
       label.
