lectures/vscode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-27 Fri 22:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>\(\mathrm{\LaTeX}\) in VSCode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jang Soo Kim" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">\(\mathrm{\LaTeX}\) in VSCode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org561ab7b">1. Basics on VSCode</a>
<ul>
<li><a href="#orgbba9ae5">1.1. Installation</a></li>
<li><a href="#org883d026">1.2. Open files</a></li>
<li><a href="#org4f8e039">1.3. Command Pallette</a></li>
<li><a href="#org63bc4f1">1.4. How to change settings</a></li>
<li><a href="#orgf9309bd">1.5. How to change themes</a></li>
<li><a href="#orgb762ccc">1.6. How to install extensions</a>
<ul>
<li><a href="#org0585f6a">1.6.1. Community Material Theme (extension)</a></li>
<li><a href="#orgf1b5629">1.6.2. Code Spell Checker (extension)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8ac55b2">2. LaTeX Workshop (extension)</a>
<ul>
<li><a href="#org787babd">2.1. Installation</a></li>
<li><a href="#orgaf4b56b">2.2. Basic commands</a>
<ul>
<li><a href="#org42fe6bf">2.2.1. Exercises</a></li>
</ul>
</li>
<li><a href="#org3a09be5">2.3. Move between sections or labels</a></li>
<li><a href="#org72fe049">2.4. Some interesting features</a></li>
<li><a href="#org5e55c9a">2.5. Snippets</a></li>
<li><a href="#org675e0b5">2.6. More Snippets</a></li>
<li><a href="#orgf42bef4">2.7. Add Keyboard shortcuts</a>
<ul>
<li><a href="#org557e89b">2.7.1. Exercise</a></li>
</ul>
</li>
<li><a href="#orgdfc2f54">2.8. Finding errors</a></li>
</ul>
</li>
<li><a href="#org7402453">3. BibTeX</a>
<ul>
<li><a href="#org10de57b">3.1. Overview</a></li>
<li><a href="#org0527890">3.2. Entries in BibTeX file</a></li>
<li><a href="#org1b1fb7e">3.3. BibTeX entries from Google Scholar</a></li>
<li><a href="#orgc204ff4">3.4. JabRef</a></li>
<li><a href="#org76c7848">3.5. bbl file</a></li>
</ul>
</li>
<li><a href="#org36bb262">4. User Snippets</a>
<ul>
<li><a href="#org755b1cd">4.1. latex.json</a></li>
<li><a href="#org1da5d46">4.2. Write user snippets (without arguments)</a>
<ul>
<li><a href="#orgd262679">4.2.1. Example</a></li>
<li><a href="#orgcdecbf5">4.2.2. Example</a></li>
</ul>
</li>
<li><a href="#orgc827c02">4.3. Write user snippets (with arguments)</a>
<ul>
<li><a href="#org174b24f">4.3.1. Example</a></li>
<li><a href="#orgad64884">4.3.2. Example (default arguments)</a></li>
</ul>
</li>
<li><a href="#org5e1cefc">4.4. Exercises</a></li>
<li><a href="#org53a2124">4.5. More Exercises</a></li>
</ul>
</li>
<li><a href="#orgb16586e">5. Code Ace Jumper (extension)</a>
<ul>
<li><a href="#org2e130e6">5.1. Overview</a></li>
<li><a href="#org83bd50b">5.2. Add Keyboard shortcuts</a></li>
<li><a href="#orgb8033cd">5.3. Change some options</a>
<ul>
<li><a href="#orga360382">5.3.1. Redefine "words"</a></li>
<li><a href="#org2e61468">5.3.2. Change the background color</a></li>
<li><a href="#orgd50e4fa">5.3.3. Change the scroll mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3008b9f">6. Vim (extension)</a>
<ul>
<li><a href="#org034baf1">6.1. Overview</a></li>
<li><a href="#org1217fad">6.2. Installation</a></li>
<li><a href="#org2f06187">6.3. Changing modes</a></li>
<li><a href="#orgd5a5586">6.4. Movements (Normal Mode)</a></li>
<li><a href="#orgbdfedd1">6.5. Editing (Normal Mode)</a></li>
<li><a href="#org8c64e21">6.6. Visual Mode</a></li>
<li><a href="#orgf6a2cc5">6.7. Finding a letter (Normal Mode)</a></li>
<li><a href="#orgf07be08">6.8. Finding a word (Normal Mode)</a></li>
<li><a href="#org2faa742">6.9. Other useful commands (Normal Mode)</a></li>
<li><a href="#orgce50f19">6.10. Useful combos</a></li>
<li><a href="#org816a4b6">6.11. Registers</a></li>
<li><a href="#orga0792df">6.12. Mark positions</a></li>
<li><a href="#org2dfb064">6.13. Dot: Repeat the previous command.</a></li>
<li><a href="#org957f183">6.14. Macros</a>
<ul>
<li><a href="#orga92f177">6.14.1. Example</a></li>
<li><a href="#orgd5028d2">6.14.2. Exercises</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge244e70">7. More tips and tricks</a>
<ul>
<li><a href="#orgc25c1d6">7.1. Hold a key to repeat it.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org561ab7b" class="outline-2">
<h2 id="org561ab7b"><span class="section-number-2">1</span> Basics on VSCode</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbba9ae5" class="outline-3">
<h3 id="orgbba9ae5"><span class="section-number-3">1.1</span> Installation</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Download here: <a href="https://code.visualstudio.com/">https://code.visualstudio.com/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org883d026" class="outline-3">
<h3 id="org883d026"><span class="section-number-3">1.2</span> Open files</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>You can open a file by drag-and-drop.</li>
<li><b>CMD + P</b> allows you to search files.</li>
<li>Note: <b>CMD</b> means Command Key for Mac and Control Key for Windows.</li>
</ul>
</div>
</div>
<div id="outline-container-org4f8e039" class="outline-3">
<h3 id="org4f8e039"><span class="section-number-3">1.3</span> Command Pallette</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>CMD + SHIFT + P</b> opens a command line showing all commands.</li>
<li>We will call this command line CP.</li>
<li>Probably the most important keyboard shortcut!</li>
<li>Very helpful when you forgot keyboard shortcuts.</li>
<li>You can also discover many things using CP.</li>
<li>Quiz: How can you make the minimap disappear?</li>
<li>Hint: Search "minimap" at CP, and you will get the answer.</li>
</ul>
</div>
</div>
<div id="outline-container-org63bc4f1" class="outline-3">
<h3 id="org63bc4f1"><span class="section-number-3">1.4</span> How to change settings</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>CP \(\rightarrow\) "Preferences: Open Settings (UI)" (or type <b>CMD+,</b>)</li>
<li>Search "Editor: Font Size".</li>
<li>Enter 14 (or any font size you want) in the box.</li>
<li>Exercise: Disable the line number.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf9309bd" class="outline-3">
<h3 id="orgf9309bd"><span class="section-number-3">1.5</span> How to change themes</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Search "theme" at CP, and choose "Preferences: Color Theme".</li>
<li>You can check out more themes from extensions.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb762ccc" class="outline-3">
<h3 id="orgb762ccc"><span class="section-number-3">1.6</span> How to install extensions</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>Click the icon "Extensions" on the left.</li>
<li>Search the extension you want to install.</li>
<li>Click "Install".</li>
</ol>
</div>
<div id="outline-container-org0585f6a" class="outline-4">
<h4 id="org0585f6a"><span class="section-number-4">1.6.1</span> Community Material Theme (extension)</h4>
<div class="outline-text-4" id="text-1-6-1">
<ol class="org-ol">
<li>Install "Community Material Theme" extension.</li>
<li>Select "Community Material Theme Palenight (Higher Contrast)" from
"Preferences: Color Theme" as we did above.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf1b5629" class="outline-4">
<h4 id="orgf1b5629"><span class="section-number-4">1.6.2</span> Code Spell Checker (extension)</h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li>Quick fix: <b>CMD + .</b></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org8ac55b2" class="outline-2">
<h2 id="org8ac55b2"><span class="section-number-2">2</span> LaTeX Workshop (extension)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org787babd" class="outline-3">
<h3 id="org787babd"><span class="section-number-3">2.1</span> Installation</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>First you need to install LaTeX Workshop using "Extensions" icon as before.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf4b56b" class="outline-3">
<h3 id="orgaf4b56b"><span class="section-number-3">2.2</span> Basic commands</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><b>TeX Compile</b> 
<ul class="org-ul">
<li>To build a pdf type <b>CMD + OPTION + B</b>.</li>
<li>If you forgot this, search "latex build" at CP.</li>
<li>Alternatively, you can simply save the tex file.</li>
<li>What's the shortcut for "Save"? (Hint: CP)</li>
</ul></li>
<li><b>View PDF</b>
<ul class="org-ul">
<li>To view a pdf, type <b>CMD + OPTION + V</b>.</li>
<li>If you forgot this, search "latex pdf" at CP.</li>
</ul></li>
<li><b>Inverse Search</b> (find source code from pdf)
<ul class="org-ul">
<li><b>CMD + left click on the pdf</b></li>
</ul></li>
<li><b>SyncTeX from cursor</b> (Forward Search)
<ul class="org-ul">
<li><b>CMD + OPTION + J</b></li>
</ul></li>
</ul>
</div>
<div id="outline-container-org42fe6bf" class="outline-4">
<h4 id="org42fe6bf"><span class="section-number-4">2.2.1</span> Exercises</h4>
<div class="outline-text-4" id="text-2-2-1">
<ol class="org-ol">
<li>Find the shortcuts for "Copy" and "Paste".</li>
<li>Discover what "Copy Line Up" and "Copy Line Down" mean.</li>
<li>Find the shortcut for "Find".</li>
<li>Find a way to comment a line.</li>
<li>Experiment with your finding in 4 by using its shortcut after selecting a
region.</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org3a09be5" class="outline-3">
<h3 id="org3a09be5"><span class="section-number-3">2.3</span> Move between sections or labels</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Click the icon \(\mathrm{\TeX}\) on the left.</li>
<li>This will show the sidebar with sections and labels.</li>
<li>By clicking a section here you can move to that section in your tex file.</li>
<li>You can toggle the sidebar with <b>CMD + B</b>. If you forgot this, you know what
to do.</li>
</ul>
</div>
</div>
<div id="outline-container-org72fe049" class="outline-3">
<h3 id="org72fe049"><span class="section-number-3">2.4</span> Some interesting features</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Auto Completion: Try to type <code>\begin{theorem}</code></li>
<li>Collapsing environments
<ul class="org-ul">
<li>Click the down arrow appearing at the left of an environment.</li>
</ul></li>
<li>Preview
<ul class="org-ul">
<li>Place your mouse pointer at an equation.</li>
</ul></li>
<li>Latex Snippet Panel 
<ul class="org-ul">
<li>CP \(\rightarrow\) "Latex Workshop: Show Snippet Panel"</li>
</ul></li>
<li>Typing "\ref{" shows all labels.
<ul class="org-ul">
<li>By clicking the arrow at the right corner, you can see the content of the
label.</li>
</ul></li>
</ul>
</div>
</div>
