lectures/vscode/vscode.org
** Exercises
   1. Write a snippet that inserts the following and place the cursor in the
      middle.
      : \langle  \rangle
   2. Write a snippet that inserts the following and place the cursor in the
      middle. (Hint: a new line can be created using ~\n~.)
      : \[
      :
      : \]
   3. Write a snippet that inserts the following, where ~x~ and ~n~ are
      given as default but can be changed to anything.
      : (x_1,x_2,\dots,x_n) 
** More Exercises
   1. LaTeX Workshop has the snippet ~BCAS~ that inserts the following.
      : \begin{cases}
      :
      : \end{cases}
      Write your own snippet with the same prefix ~BCAS~ that inserts 
      : \begin{cases}
      :   A  &  \mbox{if $B$},\\
      :   C  &  \mbox{D}.
      : \end{cases}
      and asks you to fill A, B, C, D in this order, where D is set to be
      ~otherwise~ by default, and locate the cursor below the line containing
      ~\end{cases}~.
   2. See what happens if you type ~BCAS~.

* BibTeX
** Overview
#+ATTR_REVEAL: :frag (roll-in)
   - BibTeX is a program used for generating references.
   - First you need a BibTeX file.
   - Then you need to have the following two lines in you tex file:
     :   \bibliographystyle{STYLE}
     :   \bibliography{BIBFILE}
   - ~STYLE~ can be ~abbrv~, ~alpha~, ~plain~, etc.
   - ~BIBFILE~ is the location of your BibTeX, for example, something like this:
     : /Users/jangsookim/bibtex/ref.bib
** Entries in BibTeX file
#+ATTR_REVEAL: :frag (roll-in)
   - A BibTeX file has entries like this:
     : @article{Bressoud1979,
     :   title={A generalization of the {R}ogers-{R}amanujan
     :          identities for all moduli},
     :   author={Bressoud, David M},
     :   journal={Journal of Combinatorial Theory, Series A},
     :   volume={27},
     :   number={1},
     :   pages={64--68},
     :   year={1979},
     : }
   - To cite this paper you can type ~\cite{Bressoud1979}~ in your tex file.
   - Note that in the title you must use ~{ }~ for capital letters as above.

** BibTeX entries from Google Scholar
#+ATTR_REVEAL: :frag (roll-in)
     1. Search the paper you want to cite in Google Scholar.
        https://scholar.google.com/
     2. Google Scholar will show a thumbnail for that paper.
     3. Click ~"~ at the bottom of the thumbnail.
     4. Click the BibTeX icon at the bottom.
     5. You can copy the text into you BibTeX file.

** JabRef
#+ATTR_REVEAL: :frag (roll-in)
   - JabRef is a free BibTex Manager.
   - Download here: http://www.jabref.org/
   - JabRef is useful when your BibTeX file has many entries.
   - Using JabRef you can add a new entry directly from "Web search" at the
     bottom left corner.
   - I couldn't find any BibTeX managers in VS Code extensions. Let me know if
     you found one.
** bbl file
#+ATTR_REVEAL: :frag (roll-in)
   - If you compile bibtex, it will generate a bbl file ~TEXFILENAME.bbl~, where
     ~TEXFILENAME~ is your tex filename.
   - This file contains all bibitems you need in your tex file.
   - You can copy everything in this file and paste it at the end of your tex file.
   - After this you no longer need your BibTeX file.
   - This may be helpful if you want to have a single stand-alone tex file.

* Code Ace Jumper (extension)
** Overview
   - Code Ace Jumper is an extension that allows you to jump around your file.
   - How to use:
     1. Execute "AceJump: Jump".
     2. Type a letter, say ~d~, and it will assign a letter (or two or more) to
        each word starting with ~d~.
     3. Type the letter assigned to the word that you want to move.
   - There are three more commands like this.
   - First, you need to assign keyboard shortcuts for these commands.
** Add Keyboard shortcuts
#+ATTR_REVEAL: :frag (roll-in)
   1. CP $\rightarrow$ Preferences: Open Keyboard Shortcuts
   2. Search "ace jump".
   3. You can assign a keyboard shortcut by double clicking each command. For
      example, 
      - AceJump: Jump $\rightarrow$ *CMD+J J*
      - AceJump: Line $\rightarrow$ *CMD+J L*
      - AceJump: MultiChar $\rightarrow$ *CMD+J M*
      - AceJump: Selection $\rightarrow$ *CMD+J S*
** Change some options
*** Redefine "words"
#+ATTR_REVEAL: :frag (roll-in)
    1. We want to make the ~f~ in ~\frac~ or in ~$f$~ as the start of a word.
    2. CP $\rightarrow$ Preferences: Open Settings (UI). (or ~CMD+,~ for a shortcut)
    3. Search "Ace Jump > Finder: Pattern".
    4. Add ~\\$~ at the end, just before ~]~ in 
       : [,-.{_("'<\[ ]
        so that it looks like this:
       : [,-.{_("'<\[ \\$]
*** Change the background color
    - Enter "yellow" in "Ace Jump > Placeholder: Background Color".
*** Change the scroll mode
    - Set "none" in "Ace Jump > Scroll:Mode".

* Vim (extension)
** Overview
#+ATTR_REVEAL: :frag (roll-in)
   - Vim is a modal editor meaning that it has several modes.
     - Normal mode: used for editor commands
     - Insert mode: used for inserting text
     - Command-line mode: used for doing some commands
   - Vim Extension allows us to use Vim commands inside VS Code.
   - Vim graphical cheat sheet\\
     https://eggplant.pro/blog/wp-content/uploads/2016/12/vi-vim-tutorial.pdf
** Installation 
#+ATTR_REVEAL: :frag (roll-in)
   - First you need to install Vim using "Extensions" icon as before.
   - Once you have Vim installed, you can use Vim commands immediately.
   - You can disable Vim as follows.
     1. Click Vim in "Extensions".
     2. Click "Disable".
** Changing modes
| key | command                            |
|-----+------------------------------------|
| i   | Change to Insert Mode at cursor    |
| a   | Change to Insert Mode after cursor |
| ESC | Change to Normal Mode              |
| :   | Change to Command-line Mode        |
** Movements (Normal Mode)
| key        | command               |
|------------+-----------------------|
| h, j, k, l | left, down, up, right |
| w          | next word             |
| b          | previous word         |
| CTRL+f     | page forward          |
| CTRL+b     | page backward         |
#+ATTR_REVEAL: :frag (roll-in)
    - Typing ~n~ will repeat the following command n times.
    - For example, ~4w~ is equivalent to ~wwww~.
    - You can still use the arrow keys, but it's not recommended.
