lectures/vscode.html

<div id="outline-container-org5e1cefc" class="outline-3">
<h3 id="org5e1cefc"><span class="section-number-3">4.4</span> Exercises</h3>
<div class="outline-text-3" id="text-4-4">
<ol class="org-ol">
<li><p>
Write a snippet that inserts the following and place the cursor in the
middle.
</p>
<pre class="example">
\langle  \rangle
</pre></li>
<li><p>
Write a snippet that inserts the following and place the cursor in the
middle. (Hint: a new line can be created using <code>\n</code>.)
</p>
<pre class="example">
\[

\]
</pre></li>
<li><p>
Write a snippet that inserts the following, where <code>x</code> and <code>n</code> are
given as default but can be changed to anything.
</p>
<pre class="example">
(x_1,x_2,\dots,x_n) 
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org53a2124" class="outline-3">
<h3 id="org53a2124"><span class="section-number-3">4.5</span> More Exercises</h3>
<div class="outline-text-3" id="text-4-5">
<ol class="org-ol">
<li><p>
LaTeX Workshop has the snippet <code>BCAS</code> that inserts the following.
</p>
<pre class="example">
\begin{cases}

\end{cases}
</pre>

<p>
Write your own snippet with the same prefix <code>BCAS</code> that inserts 
</p>
<pre class="example">
\begin{cases}
  A  &amp;  \mbox{if $B$},\\
  C  &amp;  \mbox{D}.
\end{cases}
</pre>

<p>
and asks you to fill A, B, C, D in this order, where D is set to be
<code>otherwise</code> by default, and locate the cursor below the line containing
<code>\end{cases}</code>.
</p></li>
<li>See what happens if you type <code>BCAS</code>.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgb16586e" class="outline-2">
<h2 id="orgb16586e"><span class="section-number-2">5</span> Code Ace Jumper (extension)</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org2e130e6" class="outline-3">
<h3 id="org2e130e6"><span class="section-number-3">5.1</span> Overview</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Code Ace Jumper is an extension that allows you to jump around your file.</li>
<li>How to use:
<ol class="org-ol">
<li>Execute "AceJump: Jump".</li>
<li>Type a letter, say <code>d</code>, and it will assign a letter (or two or more) to
each word starting with <code>d</code>.</li>
<li>Type the letter assigned to the word that you want to move.</li>
</ol></li>
<li>There are three more commands like this.</li>
<li>First, you need to assign keyboard shortcuts for these commands.</li>
</ul>
</div>
</div>
<div id="outline-container-org83bd50b" class="outline-3">
<h3 id="org83bd50b"><span class="section-number-3">5.2</span> Add Keyboard shortcuts</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>CP \(\rightarrow\) Preferences: Open Keyboard Shortcuts</li>
<li>Search "ace jump".</li>
<li>You can assign a keyboard shortcut by double clicking each command. For
example, 
<ul class="org-ul">
<li>AceJump: Jump \(\rightarrow\) <b>CMD+J J</b></li>
<li>AceJump: Line \(\rightarrow\) <b>CMD+J L</b></li>
<li>AceJump: MultiChar \(\rightarrow\) <b>CMD+J M</b></li>
<li>AceJump: Selection \(\rightarrow\) <b>CMD+J S</b></li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orgb8033cd" class="outline-3">
<h3 id="orgb8033cd"><span class="section-number-3">5.3</span> Change some options</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orga360382" class="outline-4">
<h4 id="orga360382"><span class="section-number-4">5.3.1</span> Redefine "words"</h4>
<div class="outline-text-4" id="text-5-3-1">
<ol class="org-ol">
<li>We want to make the <code>f</code> in <code>\frac</code> or in <code>$f$</code> as the start of a word.</li>
<li>CP \(\rightarrow\) Preferences: Open Settings (UI). (or <code>CMD+,</code> for a shortcut)</li>
<li>Search "Ace Jump &gt; Finder: Pattern".</li>
<li><p>
Add <code>\\$</code> at the end, just before <code>]</code> in 
</p>
<pre class="example">
[,-.{_("'&lt;\[ ]
</pre>

<p>
so that it looks like this:
</p>
<pre class="example">
[,-.{_("'&lt;\[ \\$]
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org2e61468" class="outline-4">
<h4 id="org2e61468"><span class="section-number-4">5.3.2</span> Change the background color</h4>
<div class="outline-text-4" id="text-5-3-2">
<ul class="org-ul">
<li>Enter "yellow" in "Ace Jump &gt; Placeholder: Background Color".</li>
</ul>
</div>
</div>
<div id="outline-container-orgd50e4fa" class="outline-4">
<h4 id="orgd50e4fa"><span class="section-number-4">5.3.3</span> Change the scroll mode</h4>
<div class="outline-text-4" id="text-5-3-3">
<ul class="org-ul">
<li>Set "none" in "Ace Jump &gt; Scroll:Mode".</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org3008b9f" class="outline-2">
<h2 id="org3008b9f"><span class="section-number-2">6</span> Vim (extension)</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org034baf1" class="outline-3">
<h3 id="org034baf1"><span class="section-number-3">6.1</span> Overview</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Vim is a modal editor meaning that it has several modes.
<ul class="org-ul">
<li>Normal mode: used for editor commands</li>
<li>Insert mode: used for inserting text</li>
<li>Command-line mode: used for doing some commands</li>
</ul></li>
<li>Vim Extension allows us to use Vim commands inside VSCode.</li>
<li>Vim graphical cheat sheet<br />
<a href="https://eggplant.pro/blog/wp-content/uploads/2016/12/vi-vim-tutorial.pdf">https://eggplant.pro/blog/wp-content/uploads/2016/12/vi-vim-tutorial.pdf</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1217fad" class="outline-3">
<h3 id="org1217fad"><span class="section-number-3">6.2</span> Installation</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>First you need to install Vim using "Extensions" icon as before.</li>
<li>Once you have Vim installed, you can use Vim commands immediately.</li>
<li>You can disable Vim as follows.
<ol class="org-ol">
<li>Click Vim in "Extensions".</li>
<li>Click "Disable".</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-org2f06187" class="outline-3">
<h3 id="org2f06187"><span class="section-number-3">6.3</span> Changing modes</h3>
<div class="outline-text-3" id="text-6-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">i</td>
<td class="org-left">Change to Insert Mode at cursor</td>
</tr>

<tr>
<td class="org-left">a</td>
<td class="org-left">Change to Insert Mode after cursor</td>
</tr>

<tr>
<td class="org-left">ESC</td>
<td class="org-left">Change to Normal Mode</td>
</tr>

<tr>
<td class="org-left">:</td>
<td class="org-left">Change to Command-line Mode</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd5a5586" class="outline-3">
<h3 id="orgd5a5586"><span class="section-number-3">6.4</span> Movements (Normal Mode)</h3>
<div class="outline-text-3" id="text-6-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">h, j, k, l</td>
<td class="org-left">left, down, up, right</td>
</tr>

<tr>
<td class="org-left">w</td>
<td class="org-left">next word</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">previous word</td>
</tr>

<tr>
<td class="org-left">CTRL+f</td>
<td class="org-left">page forward</td>
</tr>

<tr>
<td class="org-left">CTRL+b</td>
<td class="org-left">page backward</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Typing <code>n</code> will repeat the following command n times.</li>
<li>For example, <code>4w</code> is equivalent to <code>wwww</code>.</li>
<li>You can still use the arrow keys, but it's not recommended.</li>
</ul>
</div>
</div>
