lectures/vscode.html
<div id="outline-container-orgbdfedd1" class="outline-3">
<h3 id="orgbdfedd1"><span class="section-number-3">6.5</span> Editing (Normal Mode)</h3>
<div class="outline-text-3" id="text-6-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">y</td>
<td class="org-left">yank something</td>
</tr>

<tr>
<td class="org-left">d</td>
<td class="org-left">delete something</td>
</tr>

<tr>
<td class="org-left">p</td>
<td class="org-left">paste after</td>
</tr>

<tr>
<td class="org-left">P</td>
<td class="org-left">paste before</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">delete letter at cursor</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Deleted text is always copied in clipboard.</li>
<li>You can make a sentence using these.</li>
<li><code>yy</code> : yank line</li>
<li><code>dd</code> : delete line</li>
<li><code>dw</code> : delete word</li>
</ul>
</div>
</div>

<div id="outline-container-org8c64e21" class="outline-3">
<h3 id="org8c64e21"><span class="section-number-3">6.6</span> Visual Mode</h3>
<div class="outline-text-3" id="text-6-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">v</td>
<td class="org-left">Change to Visual Mode</td>
</tr>

<tr>
<td class="org-left">V</td>
<td class="org-left">Change to Visual Mode (line-wise)</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Visual Mode highlights a region.</li>
<li>In Visual Mode, <code>y</code> yanks the content in the selected region.</li>
<li>In Visual Mode, <code>d</code> deletes the content in the selected region.</li>
</ul>
</div>
</div>


<div id="outline-container-orgf6a2cc5" class="outline-3">
<h3 id="orgf6a2cc5"><span class="section-number-3">6.7</span> Finding a letter (Normal Mode)</h3>
<div class="outline-text-3" id="text-6-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">f \(\star\)</td>
<td class="org-left">Move cursor to \(\star\) in current line.</td>
</tr>

<tr>
<td class="org-left">t \(\star\)</td>
<td class="org-left">Move cursor before \(\star\) in current line.</td>
</tr>

<tr>
<td class="org-left">F \(\star\)</td>
<td class="org-left">Similar to "f" but backward.</td>
</tr>

<tr>
<td class="org-left">T \(\star\)</td>
<td class="org-left">Similar to "t" but backward.</td>
</tr>

<tr>
<td class="org-left">;</td>
<td class="org-left">Repeat the previous finding command.</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>\(\star\) is a letter you need to type after <code>f</code>, <code>t</code>, etc.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf07be08" class="outline-3">
<h3 id="orgf07be08"><span class="section-number-3">6.8</span> Finding a word (Normal Mode)</h3>
<div class="outline-text-3" id="text-6-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>/</code></td>
<td class="org-left">Find a word.</td>
</tr>

<tr>
<td class="org-left">n</td>
<td class="org-left">Find the next word.</td>
</tr>

<tr>
<td class="org-left">N</td>
<td class="org-left">Find the previous word.</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li><code>/abc ENTER</code> will move the cursor after the first occurrence of the word
<code>abc</code>.</li>
<li><code>n</code> will find the next occurrence of the word.</li>
<li><code>N</code> will find the previous occurrence of the word.</li>
</ul>
</div>
</div>
<div id="outline-container-org2faa742" class="outline-3">
<h3 id="org2faa742"><span class="section-number-3">6.9</span> Other useful commands (Normal Mode)</h3>
<div class="outline-text-3" id="text-6-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">u</td>
<td class="org-left">Undo</td>
</tr>

<tr>
<td class="org-left">CTRL+r</td>
<td class="org-left">Redo</td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-left">beginning of line</td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">end of line</td>
</tr>

<tr>
<td class="org-left">gg</td>
<td class="org-left">beginning of the file</td>
</tr>

<tr>
<td class="org-left">G</td>
<td class="org-left">end of the file</td>
</tr>

<tr>
<td class="org-left">zt</td>
<td class="org-left">scroll cursor to top</td>
</tr>

<tr>
<td class="org-left">zb</td>
<td class="org-left">scroll cursor to bottom</td>
</tr>

<tr>
<td class="org-left">zz</td>
<td class="org-left">scroll cursor to center</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgce50f19" class="outline-3">
<h3 id="orgce50f19"><span class="section-number-3">6.10</span> Useful combos</h3>
<div class="outline-text-3" id="text-6-10">
<ul class="org-ul">
<li><code>yf$</code>: If you are at the beginning of an inline math mode <code>$</code>, then <code>yf$</code>
can copy the whole math expression.</li>
<li><code>yt$</code>: Similar, but <code>$</code> is excluded.</li>
<li><code>dt.</code>: This will delete up to the period.</li>
<li><code>xp</code>: This will swap two letters.</li>
<li><p>
Selecting a whole section: (cursor at \section{ABC})
</p>
<pre class="example">
V / \\section Enter k
</pre></li>
<li>Selecting a whole file: <code>gg V G</code></li>
</ul>
</div>
</div>

<div id="outline-container-org816a4b6" class="outline-3">
<h3 id="org816a4b6"><span class="section-number-3">6.11</span> Registers</h3>
<div class="outline-text-3" id="text-6-11">
<ul class="org-ul">
<li>You can store something in a register.</li>
<li>The easiest way is as follows:
<ol class="org-ol">
<li>Select a region that you want to register.</li>
<li>Type <code>ay</code>, where <code>a</code> can be any letter.</li>
<li>This will register the content of the region at register <code>a</code>.</li>
<li>Type <code>ap</code> or <code>aP</code> to insert the content at register <code>a</code>.</li>
</ol></li>
<li>To view the registers type the following.<br />
<code>:reg ENTER</code></li>
</ul>
</div>
</div>
<div id="outline-container-orga0792df" class="outline-3">
<h3 id="orga0792df"><span class="section-number-3">6.12</span> Mark positions</h3>
<div class="outline-text-3" id="text-6-12">
<ul class="org-ul">
<li>You can mark the current position for future use.
<ol class="org-ol">
<li><code>ma</code> marks the current position by <code>a</code>, where <code>a</code> can be any letter.</li>
<li>Typing <code>`a</code> send you back to the position marked by <code>a</code>.</li>
</ol></li>
<li>It's helpful to mark the position where macros are defined.</li>
</ul>
</div>
</div>
<div id="outline-container-org2dfb064" class="outline-3">
<h3 id="org2dfb064"><span class="section-number-3">6.13</span> Dot: Repeat the previous command.</h3>
<div class="outline-text-3" id="text-6-13">
<ul class="org-ul">
<li><code>.</code> repeats the previously performed command.</li>
<li>For example, <code>dd</code> deletes the line at cursor. Pressing <code>.</code> will delete
another line.</li>
<li>When used carefully, this dot command can be very effective.</li>
<li>More complicated tasks can be done by macros.</li>
</ul>
</div>
</div>

<div id="outline-container-org957f183" class="outline-3">
<h3 id="org957f183"><span class="section-number-3">6.14</span> Macros</h3>
<div class="outline-text-3" id="text-6-14">
<ul class="org-ul">
<li><code>qa</code> followed by <code>q</code> records all your commands performed between them at
<code>a</code>.</li>
<li><code>@a</code> repeats the commands recorded at <code>a</code>.</li>
<li><code>@@</code> runs the previously performed macro.</li>
<li><p>
In order to write more complicated macros, you need to know more Vim
commands, for example, 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">key</th>
<th scope="col" class="org-left">command</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">c</td>
<td class="org-left">Change something</td>
</tr>

<tr>
<td class="org-left">e</td>
<td class="org-left">end of word</td>
</tr>

<tr>
<td class="org-left">0</td>
<td class="org-left">beginning of line</td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">end of line</td>
</tr>
</tbody>
</table></li>
</ul>
</div>



<div id="outline-container-orga92f177" class="outline-4">
<h4 id="orga92f177"><span class="section-number-4">6.14.1</span> Example</h4>
<div class="outline-text-4" id="text-6-14-1">
<ul class="org-ul">
<li><p>
We want to insert <code>&amp;</code> before each <code>=</code> below.
</p>
<pre class="example">
\begin{align*}
  a = b,\\
  a+a = b+b,\\
  a+a+a = b+b+b,\\
  a+a+a+a = b+b+b+b.
\end{align*}
</pre></li>
<li>We can do this using a macro like this.
<ol class="org-ol">
<li>Locate your cursor at the beginning of line 2.</li>
<li>(In Normal Mode) Press <code>qa</code>.</li>
<li>Type <code>f = i &amp; ESC k 0</code> and <code>q</code>.</li>
<li>Type <code>@a</code> and then <code>@@</code> twice.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgd5028d2" class="outline-4">
<h4 id="orgd5028d2"><span class="section-number-4">6.14.2</span> Exercises</h4>
<div class="outline-text-4" id="text-6-14-2">
<ul class="org-ul">
<li><p>
Replace each pair <code>[ ]</code> by <code>( )</code> using a macro (you may use one macro many
times).
</p>
<pre class="example">
\begin{align*}
  a[x] = b[x],\\
  a[x]+a[y] = b[x]+b[y],\\
  a[x]+a[y]+a[z] = b[x]+b[y]+b[z],\\
  a[x]+a[y]+a[z]+a[w] = b[x]+b[y]+b[z]+b[w].
\end{align*}
</pre></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orge244e70" class="outline-2">
<h2 id="orge244e70"><span class="section-number-2">7</span> More tips and tricks</h2>
<div class="outline-text-2" id="text-7">
</div>
